## Topic: Handling Null Values

### OUTCOMES

- 1. Drop The NaN Values Rows or Columns
    
    - Drop All Rows
        - df.dropna()
    
    - Drop Rows with Specific Columns have NaN
        - df.dropna(subset =["col], inplace = True)

- 2. Fill NaN Values 
    
    - fill with constant value
        - df.fillna(value)
        - df['col_name'].fillna(value)

    
    - fill with Statistical Measures
        -  df['col_name'].fillna(df['col_name'].mean())

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("student_data.csv")

df.head(6)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet
4,PH1005,Kamal Uddin,NaN,NaN,95.0,In Progress,2024-03-05,Mr. Karim,Chattogram
5,PH1006,Laila Begum,75.0,75.0,78.0,Completed,2024-03-08,Ms. Salma,Rajshahi

In [16]:
## how many unique values
# df.nunique()
len(df)

20

### 1. Drop The NaN Values Rows or Columns

#### Drop All Rows

- syntax:
    - df.dropna(how = 'any')

    - how => how to drop rows
    - any => if at least one NaN the drop rows (Default)

    - all => if all rows contain NaN then only drop.

In [ ]:
# df.dropna(how = 'any') [- if at least one NaN is Present]
new_df = df.dropna()

new_df

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet
5,PH1006,Laila Begum,75.0,75.0,78.0,Completed,2024-03-08,Ms. Salma,Rajshahi
7,PH1008,Nadia Islam,81.0,81.0,85.0,Completed,2024-04-22,Ms. Salma,Chattogram
8,PH1009,Omar Faruq,72.0,72.0,76.0,Completed,2024-05-16,Mr. David,Dhaka
9,PH1010,Priya Sharma,89.0,89.0,88.0,Completed,2024-05-20,Ms. Salma,Sylhet
11,PH1012,Sadia Chowdhury,85.0,85.0,87.0,Completed,2024-06-14,Ms. Salma,Chattogram
12,PH1013,Tanvir Ahmed,75.0,75.0,79.0,Completed,2024-07-02,Mr. David,Dhaka
14,PH1015,Wahiduzzaman,86.0,86.0,84.0,Completed,2024-08-18,Mr. Karim,Dhaka
16,PH1017,Afsana Mimi,90.0,90.0,93.0,Completed,2025-09-01,Mr. Karim,Dhaka
17,PH1018,Babul Ahmed,88.0,88.0,85.0,Completed,2025-09-05,Ms. Salma,Sylhet
19,PH1020,Nasir Khan,86.0,86.0,89.0,Completed,2025-10-02,Ms. Salma,Dhaka

In [ ]:
# after drop the entire NaN then total unique rows
len(new_df)

13

In [18]:
# df.dropna(how = "all") [- if entire rows is NaN then only drop]

new_d = df.dropna(how = "all")

print(new_d)

print("Total rows : ", len(new_d))

   StudentID          FullName  Data Structure Marks  Algorithm Marks  \
0     PH1001       Alif Rahman                  85.0             85.0
1     PH1002     Fatima Akhter                  92.0             92.0
2     PH1003     Imran Hossain                  88.0             88.0
3     PH1004  Jannatul Ferdous                  78.0             78.0
4     PH1005       Kamal Uddin                   NaN              NaN
5     PH1006       Laila Begum                  75.0             75.0
6     PH1007    Mahmudul Hasan                  80.0             80.0
7     PH1008       Nadia Islam                  81.0             81.0
8     PH1009        Omar Faruq                  72.0             72.0
9     PH1010      Priya Sharma                  89.0             89.0
10    PH1011      Rahim Sheikh                   NaN              NaN
11    PH1012   Sadia Chowdhury                  85.0             85.0
12    PH1013      Tanvir Ahmed                  75.0             75.0
13    PH1014        Urmi Akter                   NaN              NaN
14    PH1015      Wahiduzzaman                  86.0             86.0
15    PH1016      Ziaur Rahman                  94.0             94.0
16    PH1017       Afsana Mimi                  90.0             90.0
17    PH1018       Babul Ahmed                  88.0             88.0
18    PH1019      Faria Rahman                   NaN              NaN
19    PH1020        Nasir Khan                  86.0             86.0

    Python Marks CompletionStatus EnrollmentDate Instructor    Location
0           88.0        Completed     2024-01-15  Mr. Karim       Dhaka
1            NaN      In Progress     2024-01-20  Ms. Salma  Chattogram
2           85.0        Completed     2024-02-10  Mr. Karim       Dhaka
3           82.0        Completed     2024-02-12  Ms. Salma      Sylhet
4           95.0      In Progress     2024-03-05  Mr. Karim  Chattogram
5           78.0        Completed     2024-03-08  Ms. Salma    Rajshahi
6            NaN      In Progress     2024-04-01  Mr. Karim       Dhaka
7           85.0        Completed     2024-04-22  Ms. Salma  Chattogram
8           76.0        Completed     2024-05-16  Mr. David       Dhaka
9           88.0        Completed     2024-05-20  Ms. Salma      Sylhet
10          91.0      In Progress     2024-06-11  Mr. Karim      Khulna
11          87.0        Completed     2024-06-14  Ms. Salma  Chattogram
12          79.0        Completed     2024-07-02  Mr. David       Dhaka
13           NaN      Not Started     2024-07-09  Ms. Salma    Rajshahi
14          84.0        Completed     2024-08-18  Mr. Karim       Dhaka
15           NaN      In Progress     2024-08-21  Ms. Salma  Chattogram
16          93.0        Completed     2025-09-01  Mr. Karim       Dhaka
17          85.0        Completed     2025-09-05  Ms. Salma      Sylhet
18           NaN      Not Started     2025-09-15  Mr. David  Chattogram
19          89.0        Completed     2025-10-02  Ms. Salma       Dhaka
Total rows :  20

#### Drop Rows with Specific Columns have NaN

- Syntax : 
    - df.dropna(subset =["col1', 'col2'], inplace = True)

In [ ]:
# drop with specific column wise

df.dropna(subset=['Python Marks', 'Algorithm Marks'])

# if  Python Marks and Algorithm Marks has NaN then drop entire rows

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet
5,PH1006,Laila Begum,75.0,75.0,78.0,Completed,2024-03-08,Ms. Salma,Rajshahi
7,PH1008,Nadia Islam,81.0,81.0,85.0,Completed,2024-04-22,Ms. Salma,Chattogram
8,PH1009,Omar Faruq,72.0,72.0,76.0,Completed,2024-05-16,Mr. David,Dhaka
9,PH1010,Priya Sharma,89.0,89.0,88.0,Completed,2024-05-20,Ms. Salma,Sylhet
11,PH1012,Sadia Chowdhury,85.0,85.0,87.0,Completed,2024-06-14,Ms. Salma,Chattogram
12,PH1013,Tanvir Ahmed,75.0,75.0,79.0,Completed,2024-07-02,Mr. David,Dhaka
14,PH1015,Wahiduzzaman,86.0,86.0,84.0,Completed,2024-08-18,Mr. Karim,Dhaka
16,PH1017,Afsana Mimi,90.0,90.0,93.0,Completed,2025-09-01,Mr. Karim,Dhaka
17,PH1018,Babul Ahmed,88.0,88.0,85.0,Completed,2025-09-05,Ms. Salma,Sylhet
19,PH1020,Nasir Khan,86.0,86.0,89.0,Completed,2025-10-02,Ms. Salma,Dhaka

#### Drop Column with all Null Values

In [ ]:
df1 = df.dropna(axis = 1, how = "all")

df1.head(2)

# axis = 1 means column

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram

In [ ]:
# Drop column with at least one value is NaN

df2 = df.dropna(axis = 1, how = 'any')

df2

# here -> Delete all column which contain at least one NaN value

,StudentID,FullName,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,In Progress,2024-01-20,Ms. Salma,Chattogram
2,PH1003,Imran Hossain,Completed,2024-02-10,Mr. Karim,Dhaka
3,PH1004,Jannatul Ferdous,Completed,2024-02-12,Ms. Salma,Sylhet
4,PH1005,Kamal Uddin,In Progress,2024-03-05,Mr. Karim,Chattogram
5,PH1006,Laila Begum,Completed,2024-03-08,Ms. Salma,Rajshahi
6,PH1007,Mahmudul Hasan,In Progress,2024-04-01,Mr. Karim,Dhaka
7,PH1008,Nadia Islam,Completed,2024-04-22,Ms. Salma,Chattogram
8,PH1009,Omar Faruq,Completed,2024-05-16,Mr. David,Dhaka
9,PH1010,Priya Sharma,Completed,2024-05-20,Ms. Salma,Sylhet
10,PH1011,Rahim Sheikh,In Progress,2024-06-11,Mr. Karim,Khulna
11,PH1012,Sadia Chowdhury,Completed,2024-06-14,Ms. Salma,Chattogram
12,PH1013,Tanvir Ahmed,Completed,2024-07-02,Mr. David,Dhaka
13,PH1014,Urmi Akter,Not Started,2024-07-09,Ms. Salma,Rajshahi
14,PH1015,Wahiduzzaman,Completed,2024-08-18,Mr. Karim,Dhaka
15,PH1016,Ziaur Rahman,In Progress,2024-08-21,Ms. Salma,Chattogram
16,PH1017,Afsana Mimi,Completed,2025-09-01,Mr. Karim,Dhaka
17,PH1018,Babul Ahmed,Completed,2025-09-05,Ms. Salma,Sylhet
18,PH1019,Faria Rahman,Not Started,2025-09-15,Mr. David,Chattogram
19,PH1020,Nasir Khan,Completed,2025-10-02,Ms. Salma,Dhaka

### 2. Fill NaN Values

#### fill with constant value

- fill the NaN value with constant or specific values

- df.fillna(value)

- value => int, float, str

In [25]:
fill_with_zero = df.fillna(0)

fill_with_zero.head(8)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,0.0,In Progress,2024-01-20,Ms. Salma,Chattogram
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet
4,PH1005,Kamal Uddin,0.0,0.0,95.0,In Progress,2024-03-05,Mr. Karim,Chattogram
5,PH1006,Laila Begum,75.0,75.0,78.0,Completed,2024-03-08,Ms. Salma,Rajshahi
6,PH1007,Mahmudul Hasan,80.0,80.0,0.0,In Progress,2024-04-01,Mr. Karim,Dhaka
7,PH1008,Nadia Islam,81.0,81.0,85.0,Completed,2024-04-22,Ms. Salma,Chattogram

- Fill the NaN value with specific column

- syntax: df['col_name'].fillna(value)

In [ ]:
fill_name = df['FullName'].fillna("Unknow")

fill_name.head(4)

# if FullName has at least one NaN value then it's replace with Unknow values

0         Alif Rahman
1       Fatima Akhter
2       Imran Hossain
3    Jannatul Ferdous
Name: FullName, dtype: object

#### fill with Statistical Measures

- Syntax:
    - df['col_name'].fillna(df['col_name'].mean())

    - col_name => Numerical must

In [32]:
df.head(2)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram

In [ ]:
# fill Python Marks column with it's mean values

df['Python Marks'].fillna(df['Python Marks'].mean(),inplace = True)

# if Python Marks column contain NaN value then it's fill with the mena values of it's column(Python Marks)

In [39]:
df.head(4)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.000000,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,85.666667,In Progress,2024-01-20,Ms. Salma,Chattogram
2,PH1003,Imran Hossain,88.0,88.0,85.000000,Completed,2024-02-10,Mr. Karim,Dhaka
3,PH1004,Jannatul Ferdous,78.0,78.0,82.000000,Completed,2024-02-12,Ms. Salma,Sylhet

In [40]:
# fill Data Structure Marks with it's Median values

df['Data Structure Marks'].fillna(df['Data Structure Marks'].median())

0     85.0
1     92.0
2     88.0
3     78.0
4     85.5
5     75.0
6     80.0
7     81.0
8     72.0
9     89.0
10    85.5
11    85.0
12    75.0
13    85.5
14    86.0
15    94.0
16    90.0
17    88.0
18    85.5
19    86.0
Name: Data Structure Marks, dtype: float64

In [41]:
df.head(2)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.000000,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,85.666667,In Progress,2024-01-20,Ms. Salma,Chattogram

In [42]:
# fill Algorithm Marks with it's column Mode values

df['Algorithm Marks'].fillna(df['Algorithm Marks'].mode(), inplace = True)

C:\Users\HP\AppData\Local\Temp\ipykernel_12128\1062878302.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Algorithm Marks'].fillna(df['Algorithm Marks'].mode(), inplace = True)

In [43]:
df.head(3)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.000000,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,85.666667,In Progress,2024-01-20,Ms. Salma,Chattogram
2,PH1003,Imran Hossain,88.0,88.0,85.000000,Completed,2024-02-10,Mr. Karim,Dhaka

### Practice Example

In [45]:
import numpy as np

In [46]:
data = [
    {"emp_id": 101, "name": "John", "department": "IT", "salary": 85000, "age": 29},
    {"emp_id": 102, "name": "Anna", "department": None, "salary": 62000, "age": 31},
    {"emp_id": 103, "name": "David", "department": "Finance", "salary": np.nan, "age": 34},
    {"emp_id": 104, "name": "Lisa", "department": "IT", "salary": 85000, "age": np.nan},
    {"emp_id": 105, "name": "Tom", "department": "Marketing", "salary": 68000, "age": 27},
    {"emp_id": 106, "name": "Susan", "department": "Finance", "salary": None, "age": 34},
]

df = pd.DataFrame(data)
df

   emp_id   name department   salary   age
0     101   John         IT  85000.0  29.0
1     102   Anna       None  62000.0  31.0
2     103  David    Finance      NaN  34.0
3     104   Lisa         IT  85000.0   NaN
4     105    Tom  Marketing  68000.0  27.0
5     106  Susan    Finance      NaN  34.0

#### Task 1
 - Drop all rows that contain any NaN values.

In [47]:
df.dropna(how = 'any')

   emp_id  name department   salary   age
0     101  John         IT  85000.0  29.0
4     105   Tom  Marketing  68000.0  27.0

#### Task 2
- Drop rows where the department column has NaN

In [66]:
df.dropna(subset= ['department'])

   emp_id   name department   salary   age
0     101   John         IT  85000.0  29.0
2     103  David    Finance  75000.0  34.0
3     104   Lisa         IT  85000.0  31.0
4     105    Tom  Marketing  68000.0  27.0
5     106  Susan    Finance  75000.0  34.0

In [48]:
df['department'].dropna()

0           IT
2      Finance
3           IT
4    Marketing
5      Finance
Name: department, dtype: object

In [50]:
df

   emp_id   name department   salary   age
0     101   John         IT  85000.0  29.0
1     102   Anna       None  62000.0  31.0
2     103  David    Finance      NaN  34.0
3     104   Lisa         IT  85000.0   NaN
4     105    Tom  Marketing  68000.0  27.0
5     106  Susan    Finance      NaN  34.0

Task 3

Fill all missing values with "Unknown".

In [52]:
df.fillna("Unknown")

   emp_id   name department   salary      age
0     101   John         IT  85000.0     29.0
1     102   Anna    Unknown  62000.0     31.0
2     103  David    Finance  Unknown     34.0
3     104   Lisa         IT  85000.0  Unknown
4     105    Tom  Marketing  68000.0     27.0
5     106  Susan    Finance  Unknown     34.0

In [53]:
# fill values with Unknown in only department column

df['department'].fillna("Unknown")

0           IT
1      Unknown
2      Finance
3           IT
4    Marketing
5      Finance
Name: department, dtype: object

In [55]:
df

   emp_id   name department   salary   age
0     101   John         IT  85000.0  29.0
1     102   Anna       None  62000.0  31.0
2     103  David    Finance      NaN  34.0
3     104   Lisa         IT  85000.0   NaN
4     105    Tom  Marketing  68000.0  27.0
5     106  Susan    Finance      NaN  34.0

#### Task 4
- Fill missing values in the salary column with the average salary.

In [60]:
df['salary'].fillna(df['salary'].mean(), inplace = True)

df

C:\Users\HP\AppData\Local\Temp\ipykernel_12128\3506162352.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['salary'].fillna(df['salary'].mean(), inplace = True)

   emp_id   name department   salary   age
0     101   John         IT  85000.0  29.0
1     102   Anna       None  62000.0  31.0
2     103  David    Finance  75000.0  34.0
3     104   Lisa         IT  85000.0   NaN
4     105    Tom  Marketing  68000.0  27.0
5     106  Susan    Finance  75000.0  34.0

#### Task 5
- Fill missing values in the age column with the median age.

In [61]:
df['age'].fillna(df['age'].median(),inplace = True)

df

C:\Users\HP\AppData\Local\Temp\ipykernel_12128\3668286440.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].median(),inplace = True)

   emp_id   name department   salary   age
0     101   John         IT  85000.0  29.0
1     102   Anna       None  62000.0  31.0
2     103  David    Finance  75000.0  34.0
3     104   Lisa         IT  85000.0  31.0
4     105    Tom  Marketing  68000.0  27.0
5     106  Susan    Finance  75000.0  34.0

#### Task 6
- Check how many missing values exist before and after cleaning:

In [63]:
len(df)

6

In [65]:
len(new_df)

# same value because we directly change in df.

6